DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
/**
 * @file lh2.c
 * @addtogroup BSP
 * 
 * @brief  nRF52833-specific definition of the "lh2" bsp module.
 * 
 * @author Filip Maksimovic <filip.maksimovic@inria.fr>, Said Alvarado-Marin <said-alexander.alvarado-marin@inria.fr>
 * 
 * @copyright Inria, 2022
 */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <nrf.h>


#include <lh2.h>

//=========================== defines =========================================

// Interrupt priority, as high as it will go.
#define SPIM3_INTERRUPT_PRIORITY 0

// magic number definitions
#define LH2_PACKET_SIZE 5

// THIS ROBOT IS NUMBER
#define I_AM_ROBOT 420

#define D_pin 29
#define E_pin 30

#define flag 26

#define FUZZY_CHIP 0xFF

#define LH2_LOCATION_ERROR_INDICATOR 0xFFFFFFFF
#define LH2_POLYNOMIAL_ERROR_INDICATOR 255
#define LH2_DETERMINE_POLYNOMIAL_BIT_ERROR_INITIAL_THRESHOLD 4

// gpiote definitions
#define GPIOTE_CH_OUT 0
#define GPIOTE_CH_IN_ENV_HiToLo 1
#define GPIOTE_CH_IN_ENV_LoToHi 2

#define OUTPUT_PIN_NUMBER 31
#define OUTPUT_PIN_PORT 0UL
#define INPUT_PIN_NUMBER 30
#define INPUT_PIN_PORT 0UL

// SPI pin definitions
#define FAKE_SCK_PIN 6   // NOTE: SPIM needs an SCK pin to be defined, otherwise it doesn't work.
                         // nRF52840 P1.6 is used because it's not an available pin in the BCM module.

// Define SPI interface
#define SPI_INSTANCE 3 // absolutely necessary to use #3, it is the only one that is able to run at 32MHz clock
// static const nrfx_spim_t spi = NRFX_SPIM_INSTANCE(SPI_INSTANCE); /**< SPI instance. */

#define LH2_PACKET_SIZE_IN_BYTES sizeof(lh2_packet) //should be 4*5 = 20 bytes

//=========================== variables =========================================

volatile bool spi_xfer_done;

volatile bool TRANSFER_HAPPENED;
volatile int TRANSFER_COUNTER;

// variable where location packet is stored
uint32_t lh2_packet[LH2_PACKET_SIZE];

// please show me my variables?
volatile uint64_t temp1;
volatile uint64_t temp2;
volatile uint64_t temp3;
volatile uint64_t temp4;

// initialize LH2 demodulation variables
// bits sweep is the result of the demodulation, sweep_N indicates which SPI transfer those bits are associated with
volatile uint64_t LH2_bits_sweep_1 = 0;
volatile uint64_t LH2_bits_sweep_2 = 0;
volatile uint64_t LH2_bits_sweep_3 = 0;
volatile uint64_t LH2_bits_sweep_4 = 0;

// selected poly is the polyomial # (between 0 and 31) that the demodulation code thinks the demodulated bits are a part of, initialize to error state
volatile int LH2_selected_poly_1 = LH2_POLYNOMIAL_ERROR_INDICATOR;
volatile int LH2_selected_poly_2 = LH2_POLYNOMIAL_ERROR_INDICATOR;
volatile int LH2_selected_poly_3 = LH2_POLYNOMIAL_ERROR_INDICATOR;
volatile int LH2_selected_poly_4 = LH2_POLYNOMIAL_ERROR_INDICATOR;

// bit_offset indicates an offset between the start of the packet, as indicated by envelope dropping, and the 17-bit sequence that is verified to be in a known LFSR sequence
int LH2_bit_offset_1 = 0;
int LH2_bit_offset_2 = 0;
int LH2_bit_offset_3 = 0;
int LH2_bit_offset_4 = 0;

// LFSR location is the position in a given polynomial's LFSR that the decoded data is, initialize to error state
volatile uint32_t LH2_LFSR_location_1 = LH2_LOCATION_ERROR_INDICATOR; // mark as all Fs, so that if the receiver gets a -1 (signed) it knows something went horribly wrong
volatile uint32_t LH2_LFSR_location_2 = LH2_LOCATION_ERROR_INDICATOR;
volatile uint32_t LH2_LFSR_location_3 = LH2_LOCATION_ERROR_INDICATOR;
volatile uint32_t LH2_LFSR_location_4 = LH2_LOCATION_ERROR_INDICATOR;

// initialize envelope duration storage variables
volatile uint32_t LH2_envelope_duration_1 = 0xFFFFFFFF; // initialize to all 1s, error state
volatile uint32_t LH2_envelope_duration_2 = 0xFFFFFFFF;
volatile uint32_t LH2_envelope_duration_3 = 0xFFFFFFFF;
volatile uint32_t LH2_envelope_duration_4 = 0xFFFFFFFF;

// Define SPI buffer
uint8_t m_tx_buf[] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
uint8_t m_rx_buf[sizeof(m_tx_buf)+1];
const uint8_t m_length = sizeof(m_tx_buf);
volatile uint8_t spi_storage[sizeof(m_tx_buf)+1];

// arrays of bits for local storage, contents of SPI transfer are copied into this
uint8_t stored_buff[128]; // TODO: make these local variables inside of main - no reason for them to be glob
uint8_t stored_buff_1[128];
uint8_t stored_buff_2[128];
uint8_t stored_buff_3[128];
uint8_t stored_buff_4[128];

// other variables
bool ready = false;
bool buffers_ready = false;


//=========================== public ==========================================
void lh2_init(void)
{
    // Initialize the TS4231 on power-up - this is only necessary when power-cycling
    LH2_initialize_TS4231();

    // Configure the necessary Pins in the GPIO peripheral  (MOSI and CS not needed)
    lh2_pin_set_input(D_pin);           // Data_pin will become the MISO pin
    lh2_pin_set_output(FAKE_SCK_PIN);   // set SCK as Output.

    // Define the necessary Pins in the SPIM peripheral
    NRF_SPIM3->PSEL.MISO = D_pin << SPIM_PSEL_MISO_PIN_Pos  |                              // Define pin number for MISO pin
                           0 << SPIM_PSEL_MISO_PORT_Pos     |                              // Define pin port for MISO pin
                           SPIM_PSEL_MISO_CONNECT_Connected << SPIM_PSEL_MISO_CONNECT_Pos; // Enable the MISO pin

    NRF_SPIM3->PSEL.SCK = FAKE_SCK_PIN << SPIM_PSEL_SCK_PIN_Pos |                       // Define pin number for SCK pin
                          1 << SPIM_PSEL_SCK_PORT_Pos |                                 // Define pin port for SCK pin
                          SPIM_PSEL_SCK_CONNECT_Connected << SPIM_PSEL_SCK_CONNECT_Pos; // Enable the SCK pin

