DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
        return true;
    }
    return false;
}

uint32_t *get_current_location(void)
{
    TRANSFER_COUNTER = 0;
    ready = false;
    start_transfer();
    return lh2_packet;
}

void start_transfer(void)
{
    NRF_PPI->CHENSET = (PPI_CHENSET_CH2_Enabled << PPI_CHENSET_CH2_Pos) |
                       //(PPI_CHENSET_CH3_Enabled << PPI_CHENSET_CH3_Pos);
                       (PPI_CHENSET_CH4_Enabled << PPI_CHENSET_CH4_Pos) |
                       (PPI_CHENSET_CH5_Enabled << PPI_CHENSET_CH5_Pos);
}

//=========================== private =========================================

/** 
 * @brief wiggle the data and envelope lines in a magical way to configure the TS4231 to continuously read for LH2 sweep signals.
 * 
 */
void LH2_initialize_TS4231(void) {

    // Configure the wait timer 
    lh2_wait_timer_config();

    // Filip's code define these pins as inputs, and then changes them quickly to outputs. Not sure why, but it works. 
    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);

    // start the TS4231 initialization
    // Wiggle the Envelope and Data pins
    lh2_pin_set_output(E_pin);
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << E_pin; // set pin HIGH
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << E_pin; // set pin LOW
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << E_pin;
    lh2_wait_usec(1);
    lh2_pin_set_output(D_pin);
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << D_pin;
    lh2_wait_usec(1);
    // Turn the pins back to inputs
    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);
    // finally, wait 1 milisecond
    lh2_wait_usec(1000);        

    // Send the configuration magic number/sequence
    uint16_t config_val = 0x392B;
    // Turn the Data and Envelope lines back to outputs and clear them.
    lh2_pin_set_output(E_pin);
    lh2_pin_set_output(D_pin);
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << D_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << E_pin;
    lh2_wait_usec(1);
    // Send the magic configuration value, MSB first.
    for (uint8_t i = 0; i < 15; i++) {

        config_val = config_val << 1;
        if ((config_val & 0x8000) > 0)
            NRF_P0->OUTSET = 1 << D_pin;
        else
            NRF_P0->OUTCLR = 1 << D_pin;

        // Toggle the Envelope line as a clock.  
        lh2_wait_usec(1);
        NRF_P0->OUTSET = 1 << E_pin;
        lh2_wait_usec(1);
        NRF_P0->OUTCLR = 1 << E_pin;
        lh2_wait_usec(1);
    }
    // Finish send sequence and turn pins into inputs again.
    NRF_P0->OUTCLR = 1 << D_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << E_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << D_pin;
    lh2_wait_usec(1);
    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);
    // Finish by waiting 10usec
    lh2_wait_usec(10);

    // Now read back the sequence that the TS4231 answers.
    lh2_pin_set_output(E_pin);
    lh2_pin_set_output(D_pin);
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << D_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << E_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << D_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << E_pin;
    lh2_wait_usec(1);
    // Set Data pin as an input, to receive the data
    lh2_pin_set_input(D_pin);
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << E_pin;
    lh2_wait_usec(1);
    // Use the Envelope pin to output a clock while the data arrives.
    for (uint8_t i = 0; i<14; i++) {

        NRF_P0->OUTSET = 1 << E_pin;
        lh2_wait_usec(1);
        NRF_P0->OUTCLR = 1 << E_pin;
        lh2_wait_usec(1);
    }

    // Finish the configuration procedure
    lh2_pin_set_output(D_pin);
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << E_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << D_pin;
    lh2_wait_usec(1);

    NRF_P0->OUTCLR = 1 << E_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTCLR = 1 << D_pin;
    lh2_wait_usec(1);
    NRF_P0->OUTSET = 1 << E_pin;
    lh2_wait_usec(1);

    lh2_pin_set_input(D_pin);
    lh2_pin_set_input(E_pin);

    lh2_wait_usec(50000);
}

/** 
 * @brief
 * @param sample_buffer: SPI samples loaded into a local buffer
 * @return chipsH: 64-bits of demodulated data 
 */
uint64_t LH2_demodulate_light(uint8_t* sample_buffer) { // bad input variable name!!
    //TODO: rename sample_buffer
    //TODO: make it a void and have chips be a modified pointer thingie
    //FIXME: there is an edge case where I throw away an initial "1" and do not count it in the bit-shift offset, resulting in an incorrect error of 1 in the LFSR location
    uint8_t chip_index;
    uint8_t zccs_1[128];
    uint8_t chips1[128]; // TODO: give this a better name.
    uint8_t temp_byte_N; // TODO: bad variable name "temp byte"
    uint8_t temp_byte_M; // TODO: bad variable name "temp byte"

    // initialize loop variables
    uint8_t ii = 0x00;
    volatile int jj = 0;
    volatile int kk = 0;
    volatile uint64_t gg = 0;

    // initialize temporary "ones counter" variable that counts consecutive ones
    volatile int ones_counter=0;

    // initialize result:
    volatile uint64_t chipsH1=0;

    // FIND ZERO CROSSINGS
    chip_index = 0;
    zccs_1[chip_index] = 0x01;
    // for loop over bytes of the SPI buffer (jj), nested with a for loop over bits in each byte (ii)
    for(jj=0;jj<127;jj++) {
        // edge case - check if last bit (LSB) of previous byte is the same as first bit (MSB) of current byte
        // if it is not, increment chip_index and reset count
        if (jj != 0) {
            temp_byte_M = (sample_buffer[jj-1])&(0x01); // previous byte's LSB
            temp_byte_N = (sample_buffer[jj]>>7)&(0x01); // current byte's MSB
            if (temp_byte_M != temp_byte_N) {
                chip_index++;
                zccs_1[chip_index] = 1;
            }
            else {
                zccs_1[chip_index] += 1;
            }
        }
        // look at one byte at a time
        for(ii=7;ii>0;ii--){
            temp_byte_M = ((sample_buffer[jj])>>(ii))&(0x01); // bit shift by ii and mask
            temp_byte_N = ((sample_buffer[jj])>>(ii-1))&(0x01); // bit shift by ii-1 and mask
            if(temp_byte_M == temp_byte_N) {
                zccs_1[chip_index] += 1;
            }
            else {
                chip_index++;
                zccs_1[chip_index] = 1;
            }
        }
    }
    
