DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    // threshold the zero crossings into: likely one chip, likely two zero chips, or fuzzy
    for(jj=0;jj<127;jj++) {
        // not memory efficient, but ok for readability, turn ZCCS into chips by thresholding
        if(zccs_1[jj] >= 5) {
            chips1[jj] = 0;    // it's a very likely zero
        }
        else if(zccs_1[jj] <=3) {
            chips1[jj] = 1;    // it's a very likely one
        }
        else {
            chips1[jj] = FUZZY_CHIP; // fuzzy
        }
    }

    // DEMODULATION:
    // basic principles, in descending order of importance:
    //  1) an odd number of ones in a row is not allowed - this must be avoided at all costs
    //  2) finding a solution to #1 given a set of data is quite cumbersome without certain assumptions
    //    a) a fuzzy before an odd run of 1s is almost always a 1
    //    b) a fuzzy between two even runs of 1s is almost always a 0
    //    c) a fuzzy after an even run of 1s is usually a a 0
    //  3) a detected 1 is rarely wrong, but detected 0s can be, this is especially common in low-SNR readings
    //    exception: if the first bit is a 1 it is NOT reliable because the capture is asynchronous
    //  4) this is not perfect, but the earlier the chip, the more likely that it is correct. Polynomials can be used to fix bit errors later in the reading
    // known bugs/issues:
    //  1) if there are many ones at the very beginning of the reading, the algorithm will mess it up
    //  2) in some instances, the count value will be off by approximately 5, the origin of this bug is unknown at the moment
    // DEMODULATE PACKET:

    // reset variables:
    kk = 0;
    ones_counter=0;
    jj = 0;
    for (jj=0;jj<127;) { // TODO: 128 is such an easy magic number to get rid of...
        gg = 0; // TODO: this is not used here?
        if(chips1[jj]==0x00) { // zero, keep going, reset state
            jj++;
            ones_counter = 0;
        }
        if(chips1[jj]==0x01) {  // one, keep going, keep track of the # of ones
        //k_msleep(10);
            if (jj==0) {        // edge case - first chip = 1 is unreliable, do not increment 1s counter
                jj++;
            }
            else {
                jj = jj+1;
                ones_counter = ones_counter+1;
            }
        }
        if((chips1[jj]==FUZZY_CHIP)&(ones_counter==0)) { // fuzz after a zero
        //k_msleep(10);
            if(chips1[jj+1]==0) { // zero then fuzz then zero -> fuzz is a zero
                jj++;
                chips1[jj-1]=0;
            }
            else if(chips1[jj+1]==FUZZY_CHIP) { // zero then fuzz then fuzz -> just move on, you're probably screwed
                //k_msleep(10);
                jj+=2;
            }
            else if(chips1[jj+1]==1) { // zero then fuzz then one -> investigate
                kk=1;
                ones_counter=0;
                while(chips1[jj+kk]==1){
                    ones_counter++;
                    kk++;
                }
                if(ones_counter%2==1) { // fuzz -> odd ones, the fuzz is a 1
                    jj++;
                    chips1[jj-1] = 1;
                    ones_counter = 1;
                }
                else if(ones_counter%2==0) { // fuzz -> even ones, move on for now, it's indeterminate
                    jj++;
                    ones_counter = 0; // temporarily treat as a 0 for counting purposes
                }
                else { // catch statement
                    jj++;
                }
            }
        }
        else if((chips1[jj]==FUZZY_CHIP)&(ones_counter!=0)) { // ones then fuzz
        //k_msleep(10);
            if((ones_counter%2 == 0)&(chips1[jj+1]==0)) { // even ones then fuzz then zero, fuzz is a zero
                jj++;
                chips1[jj-1] = 0;
                ones_counter = 0;
            }
            if((ones_counter%2 == 0)&(chips1[jj+1]!=0)) { // even ones then fuzz then not zero - investigate
                if(chips1[jj+1] == 1) { // subsequent bit is a 1
                    kk=1;
                    while(chips1[jj+kk]==1) {
                        ones_counter++;
                        kk++;
                    }
                    if(ones_counter%2==1) { // indicates an odd # of 1s, so the fuzzy has to be a 1
                        jj++;
                        chips1[jj-1] = 1;
                        ones_counter = 1; // not actually 1, but it's ok for modulo purposes
                    }
                    else if (ones_counter%2==0) { // even ones -> fuzz -> even ones, indeterminate
                        jj++;
                        ones_counter = 0;
                    }
                }
                else if (chips1[jj+1] == FUZZY_CHIP) { // subsequent bit is a fuzzy - skip for now...
                    jj++;
                }
            }
            else if ((ones_counter%2==1)&(chips1[jj+1]==FUZZY_CHIP)) { // odd ones then fuzz then fuzz, fuzz is 1 then 0
                jj+=2;
                chips1[jj-1] = 0;
                chips1[jj-2] = 1;
                ones_counter = 0;
            }
            else if ((ones_counter%2==1)&(chips1[jj+1]!=0)) {   // odd ones then fuzz then not zero - the fuzzy has to be a 1
                jj++;
                ones_counter++;
                chips1[jj-1] = 1;
            }
            else { // catch statement
                jj++;
            }
        }
    }
    // finish up demodulation, pick off straggling fuzzies and odd runs of 1s
    for (jj=0;jj<127;) {
        if(chips1[jj]==0x00) {                 // zero, keep going, reset state
            if (ones_counter%2==1) {           // implies an odd # of 1s
                chips1[jj-ones_counter-1] = 1; // change the bit before the run of 1s to a 1 to make it even
            }            
            jj++;
            ones_counter = 0;
        }
        else if(chips1[jj]==0x01) {            // one, keep going, keep track of the # of ones
            if (jj==0) {                      // edge case - first chip = 1 is unreliable, do not increment 1s counter
                jj++;
            }
            else {
                jj = jj+1;
                ones_counter = ones_counter+1;
            }
        }
        else if (chips1[jj]==FUZZY_CHIP) {
            //if (ones_counter==0) { // fuzz after zeros, if the next chip is a 1, make it a 1, else make it a zero
            //    if (chips1[jj+1]==1) {
            //        jj+1;
            //        chips1[jj-1] = 1;
            //        ones_counter++;
            //    }
            //    else {
            //        jj++;
            //    }
            //}  <---- this is commented out because this is a VERY rare edge case and seems to be causing occasional problems w/ otherwise clean packets
            if((ones_counter!=0)&(ones_counter%2==0)) { // fuzz after even ones - at this point this is almost always a 0
                jj++;
                chips1[jj-1]=0;
                ones_counter = 0;
            }
            else if (ones_counter%2==1) { // fuzz after odd ones - exceedingly uncommon at this point, make it a 1
                jj++;
                chips1[jj-1]=1;
                ones_counter++;
            }
            else { // catch statement
                jj++;
            }
        }
        else { //catch statement
            jj++;
        }
    }

    // next step in demodulation: take the resulting array of 1 and 0 chips and put them into a single 64-bit unsigned int
    // this is primarily for easy manipulation for polynomial searching
    chip_index = 0; // TODO: rename "chip index" it's not descriptive
    chipsH1=0;
    gg = 0; // looping/while break indicating variable, reset to 0
    while (gg < 64) { // very last one - make all remaining fuzzies 0 and load it into two 64-bit longs
        if (chip_index > 127) {
            gg = 65; //break
        }
        if ((chip_index==0)&(chips1[chip_index]==0x01)) { // first bit is a 1 - ignore it
            chip_index = chip_index+1;
        }
        else if ((chip_index==0)&(chips1[chip_index]==FUZZY_CHIP)) { // first bit is fuzzy - ignore it
            chip_index = chip_index+1;
        }
        else if (gg == 63) { // load the final bit
            if (chips1[chip_index]==0) {
                chipsH1 &= 0xFFFFFFFFFFFFFFFE;
                gg = gg + 1;
                chip_index = chip_index+1;
            }
            else if (chips1[chip_index]==FUZZY_CHIP) {
                chipsH1 &= 0xFFFFFFFFFFFFFFFE;
                gg = gg + 1;
                chip_index = chip_index+1;
            }
            else if (chips1[chip_index]==0x01) {
                chipsH1 |= 0x0000000000000001;
                gg = gg + 1;
                chip_index = chip_index+2;
            }
        }
        else { // load the bit in!!
            if (chips1[chip_index]==0) {
                chipsH1 &= 0xFFFFFFFFFFFFFFFE;
                chipsH1 = chipsH1 << 1;
                gg = gg + 1;
                chip_index = chip_index+1;
            }
            else if (chips1[chip_index]==FUZZY_CHIP) {
                chipsH1 &= 0xFFFFFFFFFFFFFFFE;
                chipsH1 = chipsH1 << 1;
                gg = gg + 1;
                chip_index = chip_index+1;
            }
            else if (chips1[chip_index]==0x01) {
                chipsH1 |= 0x0000000000000001;
                chipsH1 = chipsH1 << 1;
                gg = gg + 1;
                chip_index = chip_index+2;
            }
        }
    }
    return chipsH1;
}

/** 
 * @brief from a 17-bit sequence and a polynomial, generate up to 64-17=47 bits as if the LFSR specified by poly were run forwards for numbits cycles, all little endian
 * 
 * @param poly: 17-bit polynomial
 * @param bits_in: starting seed
 * @param numbits: number of bits
 * 
 * @return sequence of bits resulting from running the LFSR forward
 */
uint64_t poly_check(uint32_t poly, uint32_t bits, uint8_t numbits) {
    uint64_t bits_out = 0;
    uint8_t  shift_counter = 1;
    uint8_t result = 0;
    uint8_t ii = 0;
    uint32_t masked_buff = 0;
    uint32_t buffer = bits;              // mask to prevent bit overflow
    poly &= 0x00001FFFF;                 // mask to prevent silliness
    bits_out |= buffer;                  // initialize 17 LSBs of result
    bits_out &= 0x00000000FFFFFFFF;      // mask because I didn't want to re-cast the buffer


    while (shift_counter<=numbits) {
        bits_out = bits_out<<1;          // shift left (forward in time) by 1
        masked_buff = ((buffer)&(poly));        // mask the buffer with the selected polynomial
        for(ii=0;ii<17;ii++) {
            result = result^((((masked_buff))>>ii)&(0x00000001)); // cumulative sum of buffer&poly
        }
        buffer = (buffer&0x0000FFFF)<<1;
        buffer |= ((result)&(0x01));
        bits_out |= ((result)&(0x01));   // put result of the XOR operation into the new bit
        result = 0;
        shift_counter++;
    }
    return bits_out;
}

/** 
 * @brief find out which LFSR polynomial the bit sequence is a member of
 * 
 * @param[in] chipsH1: input sequences of bits from demodulation
 * @param[in] start_val: number of bits between the envelope falling edge and the beginning of the sequence where valid data has been found
 * 
 * @return polynomial, indicating which polynomial was found, or FF for error (polynomial not found).
 */
int LH2_determine_polynomial(uint64_t chipsH1, int* start_val) {
    // check which polynomial the bit sequence is part of
    // TODO: make function a void and modify memory directly
    // TODO: rename chipsH1 to something relevant... like bits?
    volatile uint32_t poly0 = 0b11101001001011000;
    volatile uint32_t poly1 = 0b10111111000000100; // TODO: change this back to hex
    volatile uint32_t poly2 = 0x0001FF6B;
    volatile uint32_t poly3 = 0x00013F67; // TODO: no more magic #s here, move this to #defines
    volatile int bits_N_for_comp = 47;
    volatile int match1 = 0;
    volatile uint32_t bit_buffer1 = (uint32_t)(((0xFFFF800000000000)&chipsH1)>>47);
    volatile uint64_t bits_from_poly0 = 0;
    volatile uint64_t bits_from_poly1 = 0;
    volatile uint64_t bits_from_poly2 = 0;
    volatile uint64_t bits_from_poly3 = 0;
    volatile uint64_t weight0 = 0xFFFFFFFFFFFFFFFF;
    volatile uint64_t weight1 = 0xFFFFFFFFFFFFFFFF;
    volatile uint64_t weight2 = 0xFFFFFFFFFFFFFFFF;
    volatile uint64_t weight3 = 0xFFFFFFFFFFFFFFFF;
    volatile int selected_poly_1 = LH2_POLYNOMIAL_ERROR_INDICATOR; // initialize to error condition
    volatile uint64_t bits_to_compare = 0;
    volatile int threshold = LH2_DETERMINE_POLYNOMIAL_BIT_ERROR_INITIAL_THRESHOLD;

    *start_val = 0; // TODO: remove this? possible that I modify start value during the demodulation process

    // try polynomial vs. first buffer bits
    // this search takes 17-bit sequences and runs them forwards through the polynomial LFSRs.
    // if the remaining detected bits fit well with the chosen 17-bit sequence and a given polynomial, it is treated as "correct"
    // in case of bit errors at the beginning of the capture, the 17-bit sequence is shifted (to a max of 8 bits)
    // in case of bit errors at the end of the capture, the ending bits are removed (to a max of 
    // removing bits reduces the threshold correspondingly, as incorrect packet detection will cause a significant delay in location estimate

    // run polynomial search on the first capture
    while(match1==0) {
        // TODO: do this math stuff in multiple operations to: (a) make it readable (b) ensure order-of-execution
        bit_buffer1 = (uint32_t)(((0xFFFF800000000000>>(*start_val))&chipsH1)>>(64-17-(*start_val)));
        bits_from_poly0 = (((poly_check(poly0, bit_buffer1, bits_N_for_comp))<<(64-17-(*start_val)-bits_N_for_comp))|(chipsH1&(0xFFFFFFFFFFFFFFFF<<(64-(*start_val)))));
        bits_from_poly1 = (((poly_check(poly1, bit_buffer1, bits_N_for_comp))<<(64-17-(*start_val)-bits_N_for_comp))|(chipsH1&(0xFFFFFFFFFFFFFFFF<<(64-(*start_val)))));
        bits_from_poly2 = (((poly_check(poly2, bit_buffer1, bits_N_for_comp))<<(64-17-(*start_val)-bits_N_for_comp))|(chipsH1&(0xFFFFFFFFFFFFFFFF<<(64-(*start_val)))));
        bits_from_poly3 = (((poly_check(poly3, bit_buffer1, bits_N_for_comp))<<(64-17-(*start_val)-bits_N_for_comp))|(chipsH1&(0xFFFFFFFFFFFFFFFF<<(64-(*start_val)))));
        bits_to_compare = (chipsH1 & (0xFFFFFFFFFFFFFFFF<<(64-17-(*start_val)-bits_N_for_comp)));
        weight0 = hamming_weight(bits_from_poly0^bits_to_compare);
        weight1 = hamming_weight(bits_from_poly1^bits_to_compare);
        weight2 = hamming_weight(bits_from_poly2^bits_to_compare);
        weight3 = hamming_weight(bits_from_poly3^bits_to_compare);
        if (bits_N_for_comp < 10) { // too few bits to reliably compare, give up
            selected_poly_1 = LH2_POLYNOMIAL_ERROR_INDICATOR;  // mark the poly as "wrong"
            match1=1;
        } //TODO: implement sorting network for efficiency?
        if ((weight0<=threshold)|(weight1<=threshold)|(weight2<=threshold)|(weight3<=threshold)) {
            if ((weight0 < weight1)&(weight0 < weight2)&(weight0 < weight3)) { // weight0 is the smallest
                selected_poly_1 = 0;
                match1 = 1;
            }
            else if ((weight1 < weight0)&(weight1 < weight2)&(weight1 < weight3)) { // weight1 is the smallest
                selected_poly_1 = 1;
                match1 = 1;
            }
            else if ((weight2 < weight0)&(weight2 < weight1)&(weight2 < weight3)) { // weight2 is the smallest
                selected_poly_1 = 2;
                match1 = 1;
            }
            else if ((weight3 < weight0)&(weight3 < weight1)&(weight3 < weight2)) { // weight3 is the smallest
                selected_poly_1 = 3;
                match1 = 1;
            }
        }
        else if (*start_val > 8) { // match failed, try again removing bits from the end
            *start_val = 0;
            bits_N_for_comp = bits_N_for_comp + 1;
            if (threshold>1) {
                threshold = threshold-1;
            }
            else if (threshold==1) { // keep threshold at ones, but you're probably screwed with an unlucky bit error
                threshold = 1;
            }
        }
        else {
            *start_val = *start_val + 1;
            bits_N_for_comp=bits_N_for_comp-1;
        }
    }
    return selected_poly_1;
}

/**
 * @brief counts the number of 1s in a 64-bit 
 * 
 * @param bits_in, arbitrary bits
 * 
 * @return cumulative number of 1s inside of bits_in
 */
uint64_t hamming_weight(uint64_t bits_in) { //TODO: bad name for function? or is it, it might be a good name for a function, because it describes exactly what it does
    uint64_t weight = bits_in;
    weight =  weight - ((weight >> 1) & 0x5555555555555555);                        // find # of 1s in every 2-bit block
    weight = (weight & 0x3333333333333333) + ((weight >> 2) & 0x3333333333333333);  // find # of 1s in every 4-bit block
    weight = (weight + (weight >> 4)) & 0x0F0F0F0F0F0F0F0F;                         // find # of 1s in every 8-bit block
    weight = (weight + (weight >> 8)) & 0x00FF00FF00FF00FF;                         // find # of 1s in every 16-bit block
    weight = (weight + (weight >> 16)) & 0x0000FFFF0000FFFF;                        // find # of 1s in every 32-bit block
    weight = (weight + (weight >> 32));                                             // add the two 32-bit block results together
    weight = weight & 0x000000000000007F;                                           // mask final result, max value of 64, 0'b01000000
    return weight;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial0 with initial seed 1
 * 
 * @param bits: 17-bit sequence
 * 
 * @return count: location of the sequence
 */
uint32_t reverse_count_p0(uint32_t bits) {
    uint32_t count = 0;
    uint32_t buffer = bits&0x0001FFFFF;    // initialize buffer to initial bits, masked
    uint32_t end_buffer0     = 0x00000000000000001;  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
    uint32_t end_buffer1     = 0b10101010110011101;  //1/16 way through
    uint32_t end_buffer2     = 0b10001010101011010;  //2/16 way through
    uint32_t end_buffer3     = 0b11001100100000010;  //3/16 way through
    uint32_t end_buffer4     = 0b01100101100011111;  //4/16 way through
    uint32_t end_buffer5     = 0b10010001101011110;  //5/16 way through
    uint32_t end_buffer6     = 0b10100011001011111;  //6/16 way through
    uint32_t end_buffer7     = 0b11110001010110001;  //7/16 way through
    uint32_t end_buffer8     = 0b10111000110011011;  //8/16 way through
    uint32_t end_buffer9     = 0b10100110100011110;  //9/16 way through
    uint32_t end_buffer10     = 0b11001101100010000;  //10/16 way through
    uint32_t end_buffer11     = 0b01000101110011111;  //11/16 way through
    uint32_t end_buffer12     = 0b11100101011110101;  //12/16 way through
    uint32_t end_buffer13     = 0b01001001110110111;  //13/16 way through
    uint32_t end_buffer14     = 0b11011100110011101;  //14/16 way through
    uint32_t end_buffer15     = 0b10000110101101011;  //15/16 way through
 
    uint8_t ii = 0;                                              // loop variable for cumulative sum
    uint32_t result = 0;
    uint32_t b17 = 0;
    uint32_t masked_buff = 0;
    uint32_t poly = 0b11101001001011000;
    while (buffer!=end_buffer0)                                    // do until buffer reaches one of the saved states
    {
        b17 = buffer&0x00000001;                                  // save the "newest" bit of the buffer
        buffer=(buffer&(0x0001FFFE))>>1;                         // shift the buffer right, backwards in time
        masked_buff = (buffer)&(poly);                            // mask the buffer w/ the selected polynomial
        for(ii=0;ii<17;ii++) {
            result = result^(((masked_buff)>>ii)&(0x00000001));    // cumulative sum of buffer&poly
        }
        result = result^b17;
        buffer = buffer | (result << 16);                         // update buffer w/ result
        result = 0;                                               // reset result
        count++;
        if ((buffer^end_buffer1) == 0x00000000) {
            count = count+8192 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer2) == 0x00000000) {
            count = count+16384 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer3) == 0x00000000) {
            count = count+24576 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer4) == 0x00000000) {
            count = count+32768 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer5) == 0x00000000) {
            count = count+40960 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer6) == 0x00000000) {
            count = count+49152 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer7) == 0x00000000) {
            count = count+57344 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer8) == 0x00000000) {
            count = count+65536 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer9) == 0x00000000) {
            count = count+73728 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer10) == 0x00000000) {
            count = count+81920 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer11) == 0x00000000) {
            count = count+90112 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer12) == 0x00000000) {
            count = count+98304 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer13) == 0x00000000) {
            count = count+106496 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer14) == 0x00000000) {
            count = count+114688 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer15) == 0x00000000) {
            count = count+122880 - 1;
            buffer = end_buffer0;
        }
    }
    return count;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial1 with initial seed 1
 * 
 * @param bits: 17-bit sequence

 * @return count: location of the sequence
*/
uint32_t reverse_count_p1(uint32_t bits) {
    uint32_t count = 0;
    uint32_t buffer = bits&0x0001FFFFF;    // initialize buffer to initial bits, masked
    uint32_t end_buffer0     = 0x00000000000000001;  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
    uint32_t end_buffer1     = 0b11010000110111110;  //1/16 way through
    uint32_t end_buffer2     = 0b10110111100111100;  //2/16 way through
    uint32_t end_buffer3     = 0b11000010101101111;  //3/16 way through
    uint32_t end_buffer4     = 0b00101110001101110;  //4/16 way through
    uint32_t end_buffer5     = 0b01000011000110100;  //5/16 way through
    uint32_t end_buffer6     = 0b00010001010011110;  //6/16 way through
    uint32_t end_buffer7     = 0b10100101111010001;  //7/16 way through
    uint32_t end_buffer8     = 0b10011000000100001;  //8/16 way through
    uint32_t end_buffer9     = 0b01110011011010110;  //9/16 way through
    uint32_t end_buffer10     = 0b00100011101000011;  //10/16 way through
    uint32_t end_buffer11     = 0b10111011010000101;  //11/16 way through
    uint32_t end_buffer12     = 0b00110010100110110;  //12/16 way through
    uint32_t end_buffer13     = 0b01000111111100110;  //13/16 way through
    uint32_t end_buffer14     = 0b10001101000111011;  //14/16 way through
    uint32_t end_buffer15     = 0b00111100110011100;  //15/16 way through
 
