DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    uint8_t ii = 0;                                              // loop variable for cumulative sum
    uint32_t result = 0;
    uint32_t b17 = 0;
    uint32_t masked_buff = 0;
    uint32_t poly = 0b10111111000000100;
    while (buffer!=end_buffer0)                                    // do until buffer reaches one of the saved states
    {
        b17 = buffer&0x00000001;                                  // save the "newest" bit of the buffer
        buffer=(buffer&(0x0001FFFE))>>1;                         // shift the buffer right, backwards in time
        masked_buff = (buffer)&(poly);                            // mask the buffer w/ the selected polynomial
        for(ii=0;ii<17;ii++) {
            result = result^(((masked_buff)>>ii)&(0x00000001));    // cumulative sum of buffer&poly
        }
        result = result^b17;
        buffer = buffer | (result << 16);                         // update buffer w/ result
        result = 0;                                               // reset result
        count++;
        if ((buffer^end_buffer1) == 0x00000000) {
            count = count+8192 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer2) == 0x00000000) {
            count = count+16384 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer3) == 0x00000000) {
            count = count+24576 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer4) == 0x00000000) {
            count = count+32768 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer5) == 0x00000000) {
            count = count+40960 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer6) == 0x00000000) {
            count = count+49152 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer7) == 0x00000000) {
            count = count+57344 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer8) == 0x00000000) {
            count = count+65536 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer9) == 0x00000000) {
            count = count+73728 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer10) == 0x00000000) {
            count = count+81920 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer11) == 0x00000000) {
            count = count+90112 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer12) == 0x00000000) {
            count = count+98304 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer13) == 0x00000000) {
            count = count+106496 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer14) == 0x00000000) {
            count = count+114688 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer15) == 0x00000000) {
            count = count+122880 - 1;
            buffer = end_buffer0;
        }
    }
    return count;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial2 with initial seed 1
 * 
 * @param bits: 17-bit sequence
 * 
 * @return count: location of the sequence
 */
uint32_t reverse_count_p2(uint32_t bits) {
    uint32_t count = 0;
    uint32_t buffer = bits&0x0001FFFFF;    // initialize buffer to initial bits, masked
    uint32_t end_buffer0     = 0x00000000000000001;  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
    uint32_t end_buffer1     = 0b00011011011000100;  //1/16 way through
    uint32_t end_buffer2     = 0b01011101010010110;  //2/16 way through
    uint32_t end_buffer3     = 0b11001011001101010;  //3/16 way through
    uint32_t end_buffer4     = 0b01110001111011010;  //4/16 way through
    uint32_t end_buffer5     = 0b10110110011111010;  //5/16 way through
    uint32_t end_buffer6     = 0b10110001110000001;  //6/16 way through
    uint32_t end_buffer7     = 0b10001001011101001;  //7/16 way through
    uint32_t end_buffer8     = 0b00000010011101011;  //8/16 way through
    uint32_t end_buffer9     = 0b01100010101111011;  //9/16 way through
    uint32_t end_buffer10     = 0b00111000001101111;  //10/16 way through
    uint32_t end_buffer11     = 0b10101011100111000;  //11/16 way through
    uint32_t end_buffer12     = 0b01111110101111111;  //12/16 way through
    uint32_t end_buffer13     = 0b01000011110101010;  //13/16 way through
    uint32_t end_buffer14     = 0b01001011100000011;  //14/16 way through
    uint32_t end_buffer15     = 0b00010110111101110;  //15/16 way through
 
    uint8_t ii = 0;                                              // loop variable for cumulative sum
    uint32_t result = 0;
    uint32_t b17 = 0;
    uint32_t masked_buff = 0;
    uint32_t poly = 0b11111111101101011;
    while (buffer!=end_buffer0)                                    // do until buffer reaches one of the saved states
    {
        b17 = buffer&0x00000001;                                  // save the "newest" bit of the buffer
        buffer=(buffer&(0x0001FFFE))>>1;                         // shift the buffer right, backwards in time
        masked_buff = (buffer)&(poly);                            // mask the buffer w/ the selected polynomial
        for(ii=0;ii<17;ii++) {
            result = result^(((masked_buff)>>ii)&(0x00000001));    // cumulative sum of buffer&poly
        }
        result = result^b17;
        buffer = buffer | (result << 16);                         // update buffer w/ result
        result = 0;                                               // reset result
        count++;
        if ((buffer^end_buffer1) == 0x00000000) {
            count = count+8192 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer2) == 0x00000000) {
            count = count+16384 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer3) == 0x00000000) {
            count = count+24576 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer4) == 0x00000000) {
            count = count+32768 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer5) == 0x00000000) {
            count = count+40960 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer6) == 0x00000000) {
            count = count+49152 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer7) == 0x00000000) {
            count = count+57344 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer8) == 0x00000000) {
            count = count+65536 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer9) == 0x00000000) {
            count = count+73728 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer10) == 0x00000000) {
            count = count+81920 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer11) == 0x00000000) {
            count = count+90112 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer12) == 0x00000000) {
            count = count+98304 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer13) == 0x00000000) {
            count = count+106496 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer14) == 0x00000000) {
            count = count+114688 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer15) == 0x00000000) {
            count = count+122880 - 1;
            buffer = end_buffer0;
        }
    }
    return count;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial3 with initial seed 1
 * 
 * @param bits: 17-bit sequence
 *
 * @return count: location of the sequence
 */
uint32_t reverse_count_p3(uint32_t bits) {
    uint32_t count = 0;
    uint32_t buffer = bits&0x0001FFFFF;    // initialize buffer to initial bits, masked
    uint32_t end_buffer0     = 0x00000000000000001;  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
    uint32_t end_buffer1     = 0b11011011110010110;  //1/16 way through
    uint32_t end_buffer2     = 0b11000100000001101;  //2/16 way through
    uint32_t end_buffer3     = 0b11100011000010110;  //3/16 way through
    uint32_t end_buffer4     = 0b00011111010001100;  //4/16 way through
    uint32_t end_buffer5     = 0b11000001011110011;  //5/16 way through
    uint32_t end_buffer6     = 0b10011101110001010;  //6/16 way through
    uint32_t end_buffer7     = 0b00001011001111000;  //7/16 way through
    uint32_t end_buffer8     = 0b00111100010000101;  //8/16 way through
    uint32_t end_buffer9     = 0b01001111001010100;  //9/16 way through
    uint32_t end_buffer10     = 0b01011010010110011;  //10/16 way through
    uint32_t end_buffer11     = 0b11111101010001100;  //11/16 way through
    uint32_t end_buffer12     = 0b00110101011011111;  //12/16 way through
    uint32_t end_buffer13     = 0b01110110010101011;  //13/16 way through
    uint32_t end_buffer14     = 0b00010000110100010;  //14/16 way through
    uint32_t end_buffer15     = 0b00010111110101110;  //15/16 way through
 
    uint8_t ii = 0;                                              // loop variable for cumulative sum
    uint32_t result = 0;
    uint32_t b17 = 0;
    uint32_t masked_buff = 0;
    uint32_t poly = 0b10011111101100111;
    while (buffer!=end_buffer0)                                    // do until buffer reaches one of the saved states
    {
        b17 = buffer&0x00000001;                                  // save the "newest" bit of the buffer
        buffer=(buffer&(0x0001FFFE))>>1;                         // shift the buffer right, backwards in time
        masked_buff = (buffer)&(poly);                            // mask the buffer w/ the selected polynomial
        for(ii=0;ii<17;ii++) {
            result = result^(((masked_buff)>>ii)&(0x00000001));    // cumulative sum of buffer&poly
        }
        result = result^b17;
        buffer = buffer | (result << 16);                         // update buffer w/ result
        result = 0;                                               // reset result
        count++;
        if ((buffer^end_buffer1) == 0x00000000) {
            count = count+8192 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer2) == 0x00000000) {
            count = count+16384 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer3) == 0x00000000) {
            count = count+24576 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer4) == 0x00000000) {
            count = count+32768 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer5) == 0x00000000) {
            count = count+40960 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer6) == 0x00000000) {
            count = count+49152 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer7) == 0x00000000) {
            count = count+57344 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer8) == 0x00000000) {
            count = count+65536 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer9) == 0x00000000) {
            count = count+73728 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer10) == 0x00000000) {
            count = count+81920 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer11) == 0x00000000) {
            count = count+90112 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer12) == 0x00000000) {
            count = count+98304 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer13) == 0x00000000) {
            count = count+106496 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer14) == 0x00000000) {
            count = count+114688 - 1;
            buffer = end_buffer0;
        }
        if ((buffer^end_buffer15) == 0x00000000) {
            count = count+122880 - 1;
            buffer = end_buffer0;
        }
    }
    return count;
}

// setup the PPI
/**
 * @brief start SPI3 at falling edge of envelope, start timer2 at falling edge of envelope, stop/capture timer2 at rising edge of envelope
 *
*/
void ppi_setup(void)
{
    //uint32_t gpiote_output_task_addr  = (uint32_t)&NRF_GPIOTE->TASKS_OUT[GPIOTE_CH_OUT];
    uint32_t gpiote_input_task_addr   = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_HiToLo];
    uint32_t envelope_input_LoToHi    = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_LoToHi];
    uint32_t spi3_start_task_addr     = (uint32_t)&NRF_SPIM3->TASKS_START; 
    uint32_t spi3_stop_task_addr      = (uint32_t)&NRF_SPIM3->TASKS_STOP;
    uint32_t timer2_start_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_START;
    uint32_t timer2_stop_task_addr    = (uint32_t)&NRF_TIMER2->TASKS_STOP;
    uint32_t timer2_capture_task_addr = (uint32_t)&NRF_TIMER2->TASKS_CAPTURE[0];
    uint32_t timer2_clear_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_CLEAR;

    NRF_PPI->CH[2].EEP    = gpiote_input_task_addr;  // envelope down
    NRF_PPI->CH[2].TEP    = spi3_start_task_addr;    // start spi3 transfer
    NRF_PPI->FORK[2].TEP  = timer2_start_task_addr;  // start timer

    //NRF_PPI->CH[3].EEP    = gpiote_input_task_addr;
    //NRF_PPI->CH[3].TEP    = gpiote_output_task_addr;

    NRF_PPI->CH[4].EEP    = envelope_input_LoToHi;   // envelope up, finished lh2 data
    NRF_PPI->CH[4].TEP    = timer2_capture_task_addr;   // get time it took
    NRF_PPI->FORK[4].TEP  = timer2_stop_task_addr; // stop timer

