DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    NRF_PPI->CH[5].EEP    = envelope_input_LoToHi;
    NRF_PPI->CH[5].TEP    = timer2_clear_task_addr; // clear timer
    NRF_PPI->FORK[5].TEP  = spi3_stop_task_addr;  // stop spi3 transfer
}

/** 
 * @brief timer2 setup, in ppi_setup() this timer will CLEAR/START at falling edge of envelop signal and STOP/CAPTURE at rising edge of envelope signal
 * 
 */
void timer2_setup(void) {
    NRF_TIMER2->BITMODE = TIMER_BITMODE_BITMODE_32Bit;
    NRF_TIMER2->PRESCALER = (0UL); // 16 MHz clock counter
  
    // timer will START at falling edge of the envelope signal
    // timer will STOP at rising edge of the envelope signal
    // it is the processor's responsibility to read this timer's count value and reset it
}

/** 
 * @brief SPIM3 interrupt handler
 * 
 */
void SPIM3_IRQHandler(void)
{
    NVIC_ClearPendingIRQ(SPIM3_IRQn);

    spi_xfer_done = true;
    ready = false;
    TRANSFER_COUNTER++;

     // Check if the interrupt was caused by a fully send package
    if (NRF_SPIM3->EVENTS_ENDTX) {

        // Clear the Interrupt flag
        NRF_SPIM3->EVENTS_ENDTX = 0; 

        // load global SPI buffer (m_rx_buf) into four local arrays (stored_buff_1 ... stored_buff_4)
        volatile int lp = 0; // temporary loop variable to go through each byte of the SPI buffer
        if (TRANSFER_COUNTER==1) {
            for (lp=0;lp<m_length;lp++) {
                stored_buff_1[lp] = m_rx_buf[lp];
                m_rx_buf[lp] = 0x00;
            }
            LH2_envelope_duration_1 = NRF_TIMER2->CC[0];
        } else if (TRANSFER_COUNTER==2) {
            for (lp=0;lp<m_length;lp++) {
                stored_buff_2[lp] = m_rx_buf[lp];
                m_rx_buf[lp] = 0x00;
            }
            LH2_envelope_duration_2 = NRF_TIMER2->CC[0];
        } else if (TRANSFER_COUNTER==3) {
            for (lp=0;lp<m_length;lp++) {
                stored_buff_3[lp] = m_rx_buf[lp];
                m_rx_buf[lp] = 0x00;
            }
            LH2_envelope_duration_3 = NRF_TIMER2->CC[0];
        } else if (TRANSFER_COUNTER==4) {
            for (lp=0;lp<m_length;lp++) {
                stored_buff_4[lp] = m_rx_buf[lp];
                m_rx_buf[lp] = 0x00;
            }
            LH2_envelope_duration_4 = NRF_TIMER2->CC[0];
            NRF_PPI->CHENCLR =  (PPI_CHENCLR_CH2_Enabled << PPI_CHENCLR_CH2_Pos) |
                                //(PPI_CHENCLR_CH3_Enabled << PPI_CHENCLR_CH3_Pos);
                                (PPI_CHENCLR_CH4_Enabled << PPI_CHENCLR_CH4_Pos) |
                                (PPI_CHENCLR_CH5_Enabled << PPI_CHENCLR_CH5_Pos); // stop receiving data while it thinks
            buffers_ready = true;
        }
    }
}

/** 
 * @brief set-up GPIOTE so that events are configured for falling (GPIOTE_CH_IN) and rising edges (GPIOTE_CH_IN_ENV_HiToLo) of the envelope signal
 *
 */
void gpiote_setup(void)
{

    //NRF_GPIOTE->CONFIG[GPIOTE_CH_OUT] =           (GPIOTE_CONFIG_MODE_Task        << GPIOTE_CONFIG_MODE_Pos) | // TODO: remove this event, it exists for debug purposes
    //                                              (OUTPUT_PIN_NUMBER              << GPIOTE_CONFIG_PSEL_Pos) |
    //                                              (OUTPUT_PIN_PORT                << GPIOTE_CONFIG_PORT_Pos) |
    //                                              (GPIOTE_CONFIG_POLARITY_Toggle  << GPIOTE_CONFIG_POLARITY_Pos) |
    //                                              (GPIOTE_CONFIG_OUTINIT_High     << GPIOTE_CONFIG_OUTINIT_Pos);

    NRF_GPIOTE->CONFIG[GPIOTE_CH_IN_ENV_HiToLo] = (GPIOTE_CONFIG_MODE_Event      << GPIOTE_CONFIG_MODE_Pos) | 
                                                  (INPUT_PIN_NUMBER              << GPIOTE_CONFIG_PSEL_Pos) |
                                                  (INPUT_PIN_PORT                << GPIOTE_CONFIG_PORT_Pos) |
                                                  (GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos);

    NRF_GPIOTE->CONFIG[GPIOTE_CH_IN_ENV_LoToHi] = (GPIOTE_CONFIG_MODE_Event       << GPIOTE_CONFIG_MODE_Pos) |
                                                  (INPUT_PIN_NUMBER               << GPIOTE_CONFIG_PSEL_Pos) |
                                                  (INPUT_PIN_PORT                 << GPIOTE_CONFIG_PORT_Pos) |
                                                  (GPIOTE_CONFIG_POLARITY_LoToHi  << GPIOTE_CONFIG_POLARITY_Pos);
}

/** 
 * @brief Set a pin of port 0 as an INPUT with no pull-up or pull-down
 * @param[in] pin: port 0 pin to configure as input [0-31]
 *
 */
void lh2_pin_set_input(uint8_t pin) {

    // Configure Data pin as INPUT, with no pullup or pull down.
    NRF_P0->PIN_CNF[pin] = (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos) |
                           (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
                           (GPIO_PIN_CNF_PULL_Disabled << GPIO_PIN_CNF_PULL_Pos);
}

/** 
 * @brief Set a pin of port 0 as an OUTPUT with standard drive
 * @param[in] pin: port 0 pin to configure as input [0-31]
 *
 */
void lh2_pin_set_output(uint8_t pin) {

    // Configure Data pin as OUTPUT, with standar power drive current.
    NRF_P0->PIN_CNF[pin] = (GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos) |  // Set Pin as output
                          (GPIO_PIN_CNF_DRIVE_S0S1 << GPIO_PIN_CNF_DRIVE_Pos); // Activate high current gpio mode.
}

/** 
 * @brief Configure TIMER3 to function as a bloacking wait timer
 * 
 * The Compare events will be used to signal when enough time has passed
 * And the Shorcuts take care of stoping and reseting the timers.
 *
 */
void lh2_wait_timer_config(void) {

    // activate the external HFClock. (to help with accurate pulse timming for the LH2 initialization)
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0x00;    // Clear the flag
    NRF_CLOCK->TASKS_HFCLKSTART    = 0x01;    // Start the clock
    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {;} // Wait for the clock to actually start.

    // Innitialize TIMER 3, it's used time busy wait (to help with accurate pulse timming for the LH2 initialization)
    NRF_TIMER3->PRESCALER = (0UL);                                      // 16 MHz clock counter
    NRF_TIMER3->BITMODE = TIMER_BITMODE_BITMODE_32Bit;                  // 32 bit counter (max count value ~4.5min)
    NRF_TIMER3->MODE = TIMER_MODE_MODE_Timer << TIMER_MODE_MODE_Pos;    // Timer mode set to "Timer"
    NRF_TIMER3->SHORTS  = 0x01 << TIMER_SHORTS_COMPARE0_STOP_Pos |
                          0x01 << TIMER_SHORTS_COMPARE0_CLEAR_Pos;      // Stop the Timer as soon as the target value is achieved.
    NRF_TIMER3->CC[0] = 16;                                             // count up to 16 (1us wait)    
}

/** 
 * @brief Blocking wait in microseconds
 * @param[in] usec: number of microseconds to wait
 *
 */
void lh2_wait_usec(uint32_t usec) {

    // Load the wait time into the compare register.
    NRF_TIMER3->CC[0] = 16 * usec;                  // TIMER clock is running at 16MHz, 1 usec is 16 clock cycles.

    NRF_TIMER3->EVENTS_COMPARE[0] = 0;              // Clear the compare flag.
    NRF_TIMER3->TASKS_START = 0x01;                 // Start the timer
    while (NRF_TIMER3->EVENTS_COMPARE[0] == 0) {;}  // Wait for the clock to actually start.
}

